swak4Foam/Examples/tests/partialSlipBendedPipe/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (1.0 0 0)
    (1.1 0 0)
    (0 1.1 0)
    (0 1 0)
    (1.0 0 0.1)
    (1.1 0 0.1)
    (0 1.1 0.1)
    (0 1 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (20 100 1) simpleGrading (1 1 1)
);

edges           
(
    arc 0 3 (0.707107 0.707107 0)
    arc 4 7 (0.707107 0.707107 0.1)
    arc 1 2 (0.777817 0.777817 0)
    arc 5 6 (0.777817 0.777817 0.1)
);

patches         
(
    patch inlet 
    (
        (3 7 6 2)
    )
    patch outlet
    (
        (1 5 4 0)
    )
    wall inner 
    (
        (0 4 7 3)
    )
    wall outer 
    (
        (2 6 5 1)
    )
    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
